RT-Thread/rt-thread/bsp/lpc54608-LPCXpresso/SDK_2.2_LPCXpresso54608/sdmmc_2.1.2/src/fsl_mmc.c
static status_t MMC_SendExtendedCsd(mmc_card_t *card)
{
    assert(card);
    assert(card->host.transfer);

    HOST_COMMAND command = {0};
    HOST_TRANSFER content = {0};
    HOST_DATA data = {0};
    uint32_t i;

    command.index = kMMC_SendExtendedCsd;
    command.argument = 0U;
    command.responseType = kCARD_ResponseTypeR1;

    data.blockCount = 1U;
    data.blockSize = MMC_EXTENDED_CSD_BYTES;
    data.rxData = card->rawExtendedCsd;

    content.command = &command;
    content.data = &data;
    if ((kStatus_Success == card->host.transfer(card->host.base, &content)) &&
        (!(command.response[0U] & kSDMMC_R1ErrorAllFlag)))
    {
        /* The response is from bit 127:8 in R2, corresponding to command.response[3][31:0] to
        command.response[0U][31:8] */
        for (i = 0U; i < MMC_EXTENDED_CSD_BYTES / 4U; i++)
        {
            switch (card->host.config.endianMode)
            {
                case kHOST_EndianModeLittle:
                    /* Doesn't need to switch byte sequence when decode bytes as little endian sequence. */
                    break;
                case kHOST_EndianModeBig:
                    /* In big endian mode, the SD bus byte transferred first is the byte stored in highest position
                    in a word which cause 4 byte's sequence in a word is not consistent with their original sequence
                    from card. */
                    card->rawExtendedCsd[i] = SWAP_WORD_BYTE_SEQUENCE(card->rawExtendedCsd[i]);
                    break;
                case kHOST_EndianModeHalfWordBig:
                    card->rawExtendedCsd[i] = SWAP_HALF_WROD_BYTE_SEQUENCE(card->rawExtendedCsd[i]);
                    break;
                default:
                    return kStatus_SDMMC_NotSupportYet;
            }
        }
        MMC_DecodeExtendedCsd(card, card->rawExtendedCsd);

        return kStatus_Success;
    }

    return kStatus_SDMMC_TransferFailed;
}

static status_t MMC_SetPowerClass(mmc_card_t *card, mmc_data_bus_width_t width)
{
    assert(card);

    uint8_t mask = 0, shift = 0U;
    uint8_t powerClass = 0;
    mmc_extended_csd_config_t extendedCsdconfig;

    switch (width)
    {
        case kMMC_DataBusWidth4bit:
            mask = MMC_POWER_CLASS_4BIT_MASK; /* The mask of 4 bit bus width's power class */
            shift = 0U;
            break;
        case kMMC_DataBusWidth8bit:
            mask = MMC_POWER_CLASS_8BIT_MASK; /* The mask of 8 bit bus width's power class */
            shift = 4U;
            break;
        case kMMC_DataBusWidth1bit:
        default:
            break;
    }

    switch (card->hostVoltageWindow)
    {
        case kMMC_VoltageWindow170to195:

            if (card->currentTiming == kMMC_HighSpeed200Timing)
            {
                powerClass = ((card->extendedCsd.powerClass200MHZVCCQ195VVCC360V) & mask);
            }
            else if (card->currentTiming == kMMC_HighSpeed400Timing)
            {
                powerClass = ((card->extendedCsd.powerClass200MHZDDR360V) & mask);
            }
            else if (card->currentTiming == kMMC_HighSpeedDDR52180V300VTiming)
            {
                powerClass = ((card->extendedCsd.powerClass52MHZDDR195V) & mask);
            }
            else if (card->currentTiming == kMMC_HighSpeed52MHZTiming)
            {
                powerClass = ((card->extendedCsd.powerClass52MHz195V) & mask);
            }
            else if (card->currentTiming == kMMC_HighSpeed26MHZTiming)
            {
                powerClass = ((card->extendedCsd.powerClass26MHz195V) & mask);
            }
            else
            {
            }
            break;
        case kMMC_VoltageWindows270to360:

            if (card->currentTiming == kMMC_HighSpeed26MHZTiming)
            {
                powerClass = ((card->extendedCsd.powerClass26MHz360V) & mask);
            }
            else if (card->currentTiming == kMMC_HighSpeed52MHZTiming)
            {
                powerClass = ((card->extendedCsd.powerClass52MHz360V) & mask);
            }
            else if (card->currentTiming == kMMC_HighSpeedDDR52180V300VTiming)
            {
                powerClass = ((card->extendedCsd.powerClass52MHZDDR360V) & mask);
            }
            else
            {
            }

            break;
        default:
            powerClass = 0;
            break;
    }
    /* due to 8bit power class position [7:4] */
    powerClass >>= shift;

    extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
    extendedCsdconfig.ByteIndex = kMMC_ExtendedCsdIndexPowerClass;
    extendedCsdconfig.ByteValue = powerClass;
    extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
    if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig))
    {
        return kStatus_SDMMC_ConfigureExtendedCsdFailed;
    }
    /* restore power class */
    card->extendedCsd.powerClass = powerClass;

    return kStatus_Success;
}

static status_t MMC_SendTestPattern(mmc_card_t *card, uint32_t blockSize, uint32_t *pattern)
{
    assert(card);
    assert(card->host.transfer);
    assert(blockSize <= FSL_SDMMC_DEFAULT_BLOCK_SIZE);
    assert(pattern);

    HOST_TRANSFER content = {0};
    HOST_COMMAND command = {0};
    HOST_DATA data = {0};

    command.index = kMMC_SendingBusTest;
    command.argument = 0U;
    command.responseType = kCARD_ResponseTypeR1;

    /* Ignore errors in bus test procedure to improve chances that the test will work. */
    data.enableIgnoreError = true;
    data.blockCount = 1U;
    data.blockSize = blockSize;
    data.txData = pattern;

    content.command = &command;
    content.data = &data;
    if ((kStatus_Success != card->host.transfer(card->host.base, &content)) ||
        (command.response[0U] & kSDMMC_R1ErrorAllFlag))
    {
        return kStatus_SDMMC_TransferFailed;
    }

    return kStatus_Success;
}

static status_t MMC_ReceiveTestPattern(mmc_card_t *card, uint32_t blockSize, uint32_t *pattern)
{
    assert(card);
    assert(card->host.transfer);
    assert(blockSize <= FSL_SDMMC_DEFAULT_BLOCK_SIZE);
    assert(pattern);

    HOST_TRANSFER content = {0};
    HOST_COMMAND command = {0};
    HOST_DATA data = {0};

    command.index = kMMC_BusTestRead;
    command.responseType = kCARD_ResponseTypeR1;

